## Intro to Pandas Lib
### Classic data representation formats

- JSON
- CSV

In [2]:
import pandas as pd

In [3]:
df_one = pd.DataFrame(columns=['Column1','Column2'])
df_one

Empty DataFrame
Columns: [Column1, Column2]
Index: []

In [4]:
df_one.columns=['First','Second']
df_one

Empty DataFrame
Columns: [1, 2]
Index: []

In [7]:
data1 = {
    'First':[1,2,3,4,'real'],
    'Second': [2,3,1,32,'second']
}

data1_fram=pd.DataFrame(data1)

data1_fram

  First  Second
0     1       2
1     2       3
2     3       1
3     4      32
4  real  second

In [9]:
data = {
    'First':[66,77,'Hello'],
    'Second':[88,99,'CS4580']
}

df_one = pd.DataFrame(data)
df_three = pd.concat([df_one,data1_fram])

df_three

   First  Second
0     66      88
1     77      99
2  Hello  CS4580
0      1       2
1      2       3
2      3       1
3      4      32
4   real  second

In [ ]:
df_three.reset_index(drop=True,inplace=True)
df_three

In [11]:
# Add df column-wise
col_data = {
    'Third':[88,99,11]
}

df_four = pd.DataFrame(col_data)

# Now combine them by columns, add the axis = 1
df_combined = pd.concat([df_three,df_four],axis=1)

df_combined

   First  Second  Third
0     66      88   88.0
1     77      99   99.0
2  Hello  CS4580   11.0
0      1       2   88.0
1      2       3   99.0
2      3       1   11.0
3      4      32    NaN
4   real  second    NaN

In [22]:
## Task: Sales Data

# TODO: Define a df called df_sales with two columns: Data, Amount
df_sale = pd.DataFrame(['Data','Amount'])

# TODO: add sample data: 3 rows
data_sale = {
    'Data': ['meat','chicken','fish'],
    'Amount':[1,3,4]
}

df_sale = pd.DataFrame(data_sale)


# TODO: Create a new df with two more row of data, same columns as df_sales
add_data = {
    'Data':['Pork'],
    'Amount':[4]
}
# TODO: Combine them, and make sure indexes are correct 
df_data = pd.DataFrame(add_data)
df_combine = pd.concat([df_sale,df_data])

df_combine.reset_index(drop=True, inplace = True)
df_combine

# TODO: Add a new column called: 'Product' with 4 row of data and combine it to original df_sale
column_data= {
    "Product":['apple','milk','cheese','bread']
}

df_new= pd.DataFrame(column_data)
df_final = pd.concat([df_sale,df_new],axis=1)
df_final

      Data  Amount Product
0     meat     1.0   apple
1  chicken     3.0    milk
2     fish     4.0  cheese
3      NaN     NaN   bread